Revit 2027 API
Speckle.SpeckleColor1 Property
 The property labeled "Color 1" from the "Speckle" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SpeckleColor1 { get; }
Public Shared ReadOnly Property SpeckleColor1 As String
	Get
public:
static property String^ SpeckleColor1 {
	String^ get ();
}
static member SpeckleColor1 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Speckle Class
Autodesk.Revit.DB.Visual Namespace